<template>
    <div class="uparea">
        <el-row class="top" v-for="i of school_info.arr">
            <el-col :span="4">
                <div><img :src=i.school_id.school_name.school_img></div>
            </el-col>
            <el-col :span="18">
                <el-row>
                    <span>{{ i.school_name }}</span>
                    <div @click="collectSchool(i.school_id.school_id)" v-if="isCollect">
                        <svg t="1679901060349" class="icon" viewBox="0 0 1024 1024" version="1.1"
                            xmlns="http://www.w3.org/2000/svg" p-id="3425" width="200" height="200">
                            <path
                                d="M335.008 916.629333c-35.914667 22.314667-82.88 10.773333-104.693333-25.557333a77.333333 77.333333 0 0 1-8.96-57.429333l46.485333-198.24a13.141333 13.141333 0 0 0-4.021333-12.864l-152.16-132.586667c-31.605333-27.52-35.253333-75.648-8.234667-107.733333a75.68 75.68 0 0 1 51.733333-26.752L354.848 339.2c4.352-0.362667 8.245333-3.232 10.026667-7.594667l76.938666-188.170666c16.032-39.2 60.618667-57.92 99.52-41.461334a76.309333 76.309333 0 0 1 40.832 41.461334l76.938667 188.16c1.781333 4.373333 5.674667 7.253333 10.026667 7.605333l199.712 16.277333c41.877333 3.413333 72.885333 40.458667 69.568 82.517334a76.938667 76.938667 0 0 1-26.08 51.978666l-152.16 132.586667c-3.541333 3.082667-5.141333 8.074667-4.021334 12.853333l46.485334 198.24c9.621333 41.013333-15.36 82.336-56.138667 92.224a75.285333 75.285333 0 0 1-57.525333-9.237333l-170.976-106.24a11.296 11.296 0 0 0-12.010667 0l-170.986667 106.24z"
                                fill="#fb2105" p-id="3426"></path>
                        </svg>

                        取消关注
                    </div>
                    <div v-else @click="collectSchool(i.school_id.school_id)">
                        <svg t="1679901036923" class="icon" viewBox="0 0 1024 1024" version="1.1"
                            xmlns="http://www.w3.org/2000/svg" p-id="3270" width="200" height="200">
                            <path
                                d="M335.008 916.629333c-35.914667 22.314667-82.88 10.773333-104.693333-25.557333a77.333333 77.333333 0 0 1-8.96-57.429333l46.485333-198.24a13.141333 13.141333 0 0 0-4.021333-12.864l-152.16-132.586667c-31.605333-27.52-35.253333-75.648-8.234667-107.733333a75.68 75.68 0 0 1 51.733333-26.752L354.848 339.2c4.352-0.362667 8.245333-3.232 10.026667-7.594667l76.938666-188.170666c16.032-39.2 60.618667-57.92 99.52-41.461334a76.309333 76.309333 0 0 1 40.832 41.461334l76.938667 188.16c1.781333 4.373333 5.674667 7.253333 10.026667 7.605333l199.712 16.277333c41.877333 3.413333 72.885333 40.458667 69.568 82.517334a76.938667 76.938667 0 0 1-26.08 51.978666l-152.16 132.586667c-3.541333 3.082667-5.141333 8.074667-4.021334 12.853333l46.485334 198.24c9.621333 41.013333-15.36 82.336-56.138667 92.224a75.285333 75.285333 0 0 1-57.525333-9.237333l-170.976-106.24a11.296 11.296 0 0 0-12.010667 0l-170.986667 106.24zM551.786667 756.032l170.976 106.24c2.624 1.621333 5.717333 2.122667 8.650666 1.408 6.410667-1.557333 10.56-8.426667 8.928-15.424l-46.485333-198.24a77.141333 77.141333 0 0 1 24.277333-75.733333L870.293333 441.706667c2.485333-2.165333 4.053333-5.312 4.330667-8.746667 0.565333-7.136-4.490667-13.173333-10.976-13.696l-199.712-16.288a75.989333 75.989333 0 0 1-64.064-47.168l-76.938667-188.16a12.309333 12.309333 0 0 0-6.538666-6.741333c-5.898667-2.496-12.725333 0.373333-15.328 6.741333l-76.949334 188.16a75.989333 75.989333 0 0 1-64.064 47.168l-199.701333 16.288a11.68 11.68 0 0 0-7.978667 4.181333 13.226667 13.226667 0 0 0 1.333334 18.261334l152.16 132.586666a77.141333 77.141333 0 0 1 24.277333 75.733334l-46.485333 198.229333a13.333333 13.333333 0 0 0 1.514666 9.877333c3.488 5.792 10.581333 7.530667 16.064 4.128l170.986667-106.229333a75.296 75.296 0 0 1 79.562667 0z"
                                fill="#000000" p-id="3271"></path>
                        </svg>

                        关注
                    </div>
                </el-row>
                <el-row>
                    <svg t="1679902227332" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="9798" width="200" height="200">
                        <path
                            d="M511.954463 250.971985c-73.709769 0-133.669372 58.877969-133.669372 131.23288 0 72.339562 59.959603 131.157155 133.669372 131.157155 73.707722 0 133.639696-58.817594 133.639696-131.157155C645.594159 309.84893 585.662185 250.971985 511.954463 250.971985M511.954463 455.252555c-40.97625 0-74.311473-32.779567-74.311473-73.078389 0-40.284495 33.334199-73.077366 74.311473-73.077366 40.945551 0 74.278727 32.79287 74.278727 73.077366C586.23319 422.472987 552.900014 455.252555 511.954463 455.252555"
                            fill="#ffffff" p-id="9799"></path>
                        <path
                            d="M824.811914 401.684522c0-169.441087-140.347468-307.277362-312.857451-307.277362-172.479283 0-312.768423 137.836275-312.768423 307.277362 0 132.88552 192.606693 400.645866 275.461749 509.584997 8.724709 11.492752 22.683628 18.321274 37.305651 18.321274 14.5903 0 28.580942-6.828522 37.334303-18.321274C632.11517 802.331411 824.811914 534.602787 824.811914 401.684522M516.887822 864.759229l-4.933359 6.557346-4.934382-6.557346C350.606705 656.92881 253.370103 479.470119 253.370103 401.684522c0-140.062989 115.979478-254.012228 258.58436-254.012228 142.575206 0 258.552637 113.949238 258.552637 254.012228C770.537799 479.499795 673.36055 656.92881 516.887822 864.759229"
                            fill="#ffffff" p-id="9800"></path>
                    </svg>
                    {{ i.school_address }}
                </el-row>
                <el-row>
                    <span v-if="i.school_id.is_985 == 1">985</span>
                    <span v-if="i.school_id.is_211 == 1">211</span>
                    <span v-if="i.school_id.syl == 1">双一流</span>
                    <span>{{ i.school_id.type_name }}</span>
                    <span>{{ i.school_id.province_area }}区</span>
                </el-row>
                <el-row>
                    <svg t="1679902186947" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="8750" width="200" height="200">
                        <path
                            d="M290.0992 409.6H155.136a371.4048 371.4048 0 0 0-14.2848 102.4c0 35.5328 4.9664 69.888 14.336 102.4h134.9632c-5.632-32.768-8.4992-66.9184-8.4992-102.4 0-35.4816 2.8672-69.632 8.4992-102.4z m52.0704 0a542.1056 542.1056 0 0 0-9.3696 102.4c0 35.7376 3.072 69.888 9.3696 102.4H486.4V409.6H342.1696z m75.008 461.3632A491.8784 491.8784 0 0 1 301.568 665.6H173.9776a372.0704 372.0704 0 0 0 243.2 205.3632z m69.2224-3.584V665.6H354.9696c24.064 77.1072 67.84 144.2304 131.4304 201.8304zM417.1776 153.088A372.0704 372.0704 0 0 0 173.9776 358.4H301.568a491.8784 491.8784 0 0 1 115.5584-205.3632z m69.2224 3.584C422.8096 214.1184 379.0848 281.2416 354.9696 358.4H486.4V156.5696zM733.9008 409.6c5.632 32.768 8.4992 66.9184 8.4992 102.4 0 35.4816-2.8672 69.632-8.4992 102.4h135.0144c9.3184-32.512 14.2848-66.8672 14.2848-102.4s-4.9664-69.888-14.336-102.4h-134.9632z m-52.0704 0H537.6v204.8h144.2304c6.2464-32.512 9.3696-66.6624 9.3696-102.4s-3.072-69.888-9.3696-102.4z m-75.008 461.3632A372.0704 372.0704 0 0 0 850.0224 665.6H722.432a491.8784 491.8784 0 0 1-115.5584 205.3632z m-69.2224-3.584c63.5904-57.5488 107.3152-124.672 131.4304-201.7792H537.6v201.8304zM606.8224 153.088A491.8784 491.8784 0 0 1 722.432 358.4h127.6416a372.0704 372.0704 0 0 0-243.2-205.3632z m-69.2224 3.584V358.4h131.4304c-24.064-77.1072-67.84-144.2304-131.4304-201.8304zM512 947.2a435.2 435.2 0 1 1 0-870.4 435.2 435.2 0 0 1 0 870.4z"
                            fill="#ffffff" p-id="8751"></path>
                    </svg>
                    <span>官网地址：</span>
                    <span><a :href=i.school_site>{{ i.school_site }}</a></span>
                    <span><a :href="i.zhaoban_site">{{ i.zhaoban_site }}</a></span>
                </el-row>
                <el-row>
                    <svg t="1679902154844" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="7340" width="200" height="200">
                        <path
                            d="M446.272 573.44a509.653333 509.653333 0 0 1-81.92-100.650667c67.786667-30.474667 112.138667-93.461333 112.138667-169.792C476.48 194.592 388.96 106.666667 280.906667 106.666667 170.058667 106.666667 85.333333 188.746667 85.333333 302.997333c0 158.250667 82.56 328.554667 200.618667 439.658667 100.010667 94.122667 258.986667 161.738667 413.461333 174.570667 0.832 0.074667 1.674667 0.106667 2.517334 0.106666h41.162666a30.517333 30.517333 0 0 0 0-61.045333h-39.872c-140.672-11.978667-286.026667-73.930667-375.456-158.090667-106.410667-100.16-181.408-254.837333-181.408-395.2 0-80.106667 56.981333-135.285333 134.549334-135.285333 74.282667 0 134.549333 60.533333 134.549333 135.285333 0 60.309333-40.896 107.989333-103.008 123.349334a30.517333 30.517333 0 0 0-19.786667 43.658666c27.573333 53.312 66.037333 104.426667 111.573334 147.690667 51.264 48.693333 109.941333 86.112 172.053333 108.16a30.506667 30.506667 0 0 0 40.362667-24.064c10.453333-67.093333 61.621333-114.026667 126.442666-114.026667 74.272 0 134.549333 60.544 134.549334 135.285334 0 25.578667-7.04 50.026667-20.149334 71.253333a30.528 30.528 0 0 0 51.925334 32.074667A196.096 196.096 0 0 0 938.666667 723.050667c0-108.394667-87.530667-196.330667-195.573334-196.330667-83.072 0-151.210667 52.384-177.621333 128.864-42.368-19.552-82.773333-47.541333-119.2-82.144z"
                            fill="#ffffff" p-id="7341"></path>
                    </svg>
                    <span>官方电话：</span>
                    <span>{{ i.school_phone }}</span>
                    <span>{{ i.zhaoban_phone }}</span>
                </el-row>
                <el-row>
                    <svg t="1679901564778" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="5994" width="200" height="200">
                        <path
                            d="M838.954667 234.666667H170.666667c-3.626667 0-7.168 0.448-10.56 1.322666l323.690666 323.669334a21.333333 21.333333 0 0 0 30.165334 0L838.954667 234.666667z m46.144 14.186666l-260.693334 260.693334 262.933334 262.912c5.44-7.168 8.661333-16.106667 8.661333-25.792V277.333333c0-10.944-4.117333-20.906667-10.88-28.48zM843.861333 789.333333l-249.6-249.621333-50.133333 50.133333a64 64 0 0 1-90.517333 0l-50.112-50.133333L156.373333 786.88c4.48 1.578667 9.28 2.453333 14.314667 2.453333h673.194667zM128.661333 754.218667L373.333333 509.525333 129.578667 265.813333A42.709333 42.709333 0 0 0 128 277.333333v469.333334c0 2.56 0.213333 5.098667 0.661333 7.552zM170.666667 192h682.666666a85.333333 85.333333 0 0 1 85.333334 85.333333v469.333334a85.333333 85.333333 0 0 1-85.333334 85.333333H170.666667a85.333333 85.333333 0 0 1-85.333334-85.333333V277.333333a85.333333 85.333333 0 0 1 85.333334-85.333333z"
                            fill="#ffffff" p-id="5995"></path>
                    </svg>
                    <span>电子邮箱：</span>
                    <span>{{ i.school_email }}</span>
                </el-row>
            </el-col>
        </el-row>
        <el-row class="navTop">
            <div>
                <RouterLink :to="{ name: 'schoolView' }">学校概况</RouterLink>
            </div>
            <div>
                <RouterLink :to="{ name: 'reexamine' }">复试分数</RouterLink>
            </div>
            <div><router-link :to="{ name: 'zhaoshengxinxi' }">招生专业</router-link></div>
            <div>
                <RouterLink :to="{ name: 'community' }">交流区</RouterLink>
            </div>
        </el-row>
    </div>
    <router-view></router-view>

    <el-dialog v-model="centerDialogVisible" title="警告" width="30%" center>
    <span>
      您还没有登录,无法使用，请先登录！！
    </span>
    <template #footer>
      <span class="dialog-footer">
        <el-button @click="centerDialogVisible = false">知道了</el-button>
      </span>
    </template>
  </el-dialog>
</template>

<script setup>
import { ref, reactive, watch, computed, nextTick, onMounted, toRaw, provide } from "vue"
import { useRoute, useRouter } from 'vue-router'
import requestFn from "@/api/requestFn";
import store from "@/store";
const isLogin = store.state.isLogin
const route = useRoute()
const school_id = route.params
const school_info = reactive({ arr: [] })
const isCollect = ref(false)
const centerDialogVisible=ref(false)
const collectSchool = (e) => {
    if (isLogin) {
        isCollect.value = !isCollect.value
        requestFn({
            url: '/collectSchool',
            method: 'post',
            data: {
                school_id: e,
                user: store.state.current_user
            }
        }).then(data => {
            // console.log(data.data)
        })
    }else{
        centerDialogVisible.value=true
    }

}




onMounted(() => {
    requestFn({
        url: '/singSchoolInfo',
        method: 'post',
        data: {
            school_id: school_id.school_id
        }
    }).then(data => {
        // school_info.arr=data.data
        school_info.arr = data.data
    })
    requestFn({
        url: '/isCollect',
        method: 'post',
        data: {
            school_id: school_id.school_id,
            user: store.state.current_user
        }
    }).then(data => {
        isCollect.value = data.data
    })
})

</script>

<style scoped>
.uparea {
    width: 1200px;
    background: linear-gradient(131deg, #f60, #ffbb48);
    margin: 0px auto;
}

.top,
.navTop {

    padding: 20px 20px;
}

.top .el-col:nth-of-type(1) div {
    width: 160px;
    height: 160px;
    text-align: center;
    vertical-align: middle;
    display: table-cell;
    border-radius: 15px;
    background-color: white;

    /* background-color: white; */
}

.top .el-col:nth-of-type(2) .el-row {
    margin-bottom: 10px;
}

.top .el-col:nth-of-type(2) .el-row svg {
    width: 15px;
    height: 15px;
    margin-right: 10px;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(1) {
    display: flex;
    justify-content: flex-start;
    align-items: center;

}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(1) span {
    font-size: 26px;
    color: white;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(1) div {
    margin-left: 10px;
    display: flex;
    justify-content: center;
    align-items: center;
    font-size: 16px;
    color: #ff6600;
    background-color: white;
    padding: 5px 10px;
    border-radius: 10px;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(1) div svg {
    width: 20px;
    height: 20px;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(2) {
    color: white;
    font-size: 14px;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(3) span {
    margin-right: 10px;
    font-size: 14px;
    color: white;
}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(4) span {
    margin-right: 10px;
    font-size: 14px;
    color: white;

}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(5) span {
    margin-right: 10px;
    font-size: 14px;
    color: white;

}

.top .el-col:nth-of-type(2) .el-row:nth-of-type(6) span {
    margin-right: 10px;
    font-size: 14px;
    color: white;

}

.top .el-col:nth-of-type(1) div img {
    width: 120px;
    height: 120px;


    /* display: table-cell; */
}

.top .el-col .el-row {
    display: flex;
}

.navTop {
    display: flex;
    justify-content: space-around;
    font-size: 18px;
    color: white;
}

.navTop div {
    width: 180px;
    height: 40px;
    text-align: center;
    color: #000;
}</style>